      * variables
      *declaring the Fix format style
     D CallingPGM      pr                  ExtPgm('HELLOWORD')
      *
     C                   Call      'HELLOWORD'

      /free

          Callp CallingPGM();  // CALLING  ANOTHER PROGRAM



        *inlr = *on;
      /end-free

