      * variable decalration
     D Num1            s              5s 0
     D String          s             20A

      *Param List and parms

     C     *entry        PLIST
     C                   parm                    String

      /Free
        dsply  String;



        *inlr= *on;
      /End-free
